Revit 2027 API
Wall.CanSetHostWall Method
 Checks whether this wall can be associated with the specified host wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSetHostWall(
	ElementId hostWallId
)
Public Function CanSetHostWall (
	hostWallId As ElementId
) As Boolean
public:
bool CanSetHostWall(
	ElementId^ hostWallId
)
member CanSetHostWall :
        hostWallId : ElementId -> bool
Parameters
hostWallId ElementId
 The element ID of the host wall to check association against.
Return Value
Boolean
 True if the wall can be associated with the specified host wall.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace